def area(a, b):
    ''' возвращает площадь прямоугольника

                Параметры:
                      a(int): одна сторона прямоугольника
                      b(int): перпендикулярная стороне a сторона прямоугльника

                Возвращаемое значение:
                      произведение обеих сторон (т.е. площадь)
    '''
    return a * b

def perimeter(a, b):
    ''' возвращает периметер прямоугольника

                Параметры:
                      a(int): одна сторона прямоугольника
                      b(int): перпендикулярная стороне а сторона прямоугольника

                Возвращаемое значение:
                      сумма всех четырёх сторон прямоугольника (т.е. периметер)
    '''
    return 2 * a + 2 * b
