def area(a):
    ''' возвращает площадь квадарата.

                Параметры:
                        a(int): десятичное число - сторона квадрата

                Возвращаемое значение:
                        произведение 2-х сторон квадрата (т.е. его площадь)
    '''
    
    return a * a


def perimeter(a):
    ''' возвращает периметер квадарата.

                Параметры:
                        a(int): десятичное число - сторона квадрата

                Возвращаемое значение:
                        сумма всех сторон квадрата (т.е. его периметер)
    '''
    
    return 4 * a
